{-
  Задача 1. Да се напише функция mygcd a b, която връща НОД(a, b).


  Задача 2. Да се дефинира функция reverseNumber, която генерира линейно итеративен процес и 
  по дадено естествено число n намира числото, записано със същите цифри, но в обратен ред.


  Задача 3. Да се дефинира предикат isPrime, който проверява дали дадено естествено число е просто.
  Забележка: Числото 1 не е нито просто, нито съставно.


  Задача 4. Да се напише предикат isAscending, който връща истина, ако цифрите на дадено естествено 
  число са в нарастващ ред от първата към последната.


  Задача 5. Да се напише функция countOccurences, намираща броя на срещанията на дадена цифра d в записа на число n.


  Задача 6. Да се напише предикат isPerfectNumber, който връща дали едно число е съвършено, т.е. равно на сумата от делите си.


  Задача 7. Да се дефинира функция sumPrimeDivisors, която намира сумата на всички прости делители на едно число.
-}
